In [2]:
import pandas as pd
import numpy as np

# Creating data frames - {array , dictionaries , csv files}

In [3]:
# Option 1 -With Arrays

# creating an array
data = np.array([[1,4],[2,5],[3,6]])
# creating a data frame
df = pd.DataFrame(data, index=['row1', 'row2', 'row3'],
                    columns=['col1', 'col2'])
# printing
df

      col1  col2
row1     1     4
row2     2     5
row3     3     6

In [4]:
# option 2 - creating a df from a Dictionary

state = ['California','Texas','Florida','New York']
population = [10000 , 20000,30000,40000]

dict_states = {'States':state, 'Population':population}

df_population = pd.DataFrame(dict_states)

df_population

       States  Population
0  California       10000
1       Texas       20000
2     Florida       30000
3    New York       40000

In [7]:
# option three  - creating a dataframe using a csv file

df_salaries = pd.read_csv("../Assets/annual.csv")

# shows first five rows in a data frame
df_salaries.head()

# Add a number inside Parenthesis

# shows last five rows in a dataframe
df_salaries.tail()

#  get the number of rows and columns
df_salaries.shape

,Period,Inst_sector,Inst_sector_code,Descriptor,SNA08TRANS,Asset_liability_code,Values
7747,2023.03,Total all sectors,900,Capital Account Closing balances Total non-fin...,LE00000,AN00000,3017380
7748,2023.03,Total all sectors,900,Capital Account Closing balances Produced non-...,LE00000,AN10000,1440803
7749,2023.03,Total all sectors,900,Capital Account Closing balances Non-produced ...,LE00000,AN20000,1576577
7750,2023.03,Total all sectors,900,Closing balance net worth,LE00000,B900000,3017380
7751,2023.03,Total all sectors,900,Closing balance total liabilities and net worth,LE00000,L000000,7678630

In [10]:
# display n rows
pd.set_option('display.max_rows', 1000)
df_salaries

,Period,Inst_sector,Inst_sector_code,Descriptor,SNA08TRANS,Asset_liability_code,Values
0,2007.03,Non-corporate business enterprises,121,Closing balance total assets,LE00000,A000000,345948
1,2007.03,Non-corporate business enterprises,121,Financial assets Closing balance Total financi...,LE00000,AFA0000,99748
2,2007.03,Non-corporate business enterprises,121,Financial assets Closing balance monetary gold...,LE00000,AFA0100,0
3,2007.03,Non-corporate business enterprises,121,Financial assets Closing balance currency and ...,LE00000,AFA0200,14773
4,2007.03,Non-corporate business enterprises,121,Financial assets Closing balance debt securities,LE00000,AFA0300,1267
...,...,...,...,...,...,...,...
7747,2023.03,Total all sectors,900,Capital Account Closing balances Total non-fin...,LE00000,AN00000,3017380
7748,2023.03,Total all sectors,900,Capital Account Closing balances Produced non-...,LE00000,AN10000,1440803
7749,2023.03,Total all sectors,900,Capital Account Closing balances Non-produced ...,LE00000,AN20000,1576577
7750,2023.03,Total all sectors,900,Closing balance net worth,LE00000,B900000,3017380
7751,2023.03,Total all sectors,900,Closing balance total liabilities and net worth,LE00000,L000000,7678630